rules = {
    'причастие': ['Правило 1', "Правило 2"],
    'деепричастие': ['Правило 3', "Правило 4"]
}

task = {
        "причастие": [
            {
            'rule': 0,
            'sent': 'Солнце (1) слепящее глаза (2) стоит в зените',
            'var': ['1', '2', '1, 2'],
            'correct': 2
            }
        ],
    'деепричастие': [
        {
            'rule': 1,
            'sent': 'Встал утром (1) очень радуясь (2) и пошёл есть',
            'var': ['1', '2', '1, 2'],
            'correct': 1
        }
    ]

    }